<a href="https://colab.research.google.com/github/egag8843/Colab_New/blob/main/3_Pandas_%EC%8B%A4%EC%8A%B5%ED%95%98%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
"""
날짜: 2021/07/05
이름: 장경준
내용: 파이썬 Pandas 실습하기
"""

import pandas as pd

In [ ]:
#dataframe 생성
df1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df1

In [ ]:
#컴럼명을 갖는 DataFrame 생성
df2 = pd.DataFrame({'uid' : ['a101','a102','a103','a104','a105'],
                    'name' : ['김유신','김춘추','장보고','강감찬','이순신'],
                    'age' : [25,21,32,41,52]})
df2

In [ ]:
#dataframe 출력
print(df1[0][0])
print(df1[0][1])
print(df1[1][2])
print(df2['uid'][0])
print(df2['name'][1])
print(df2['name'][4])

In [12]:
#구글 드라이브 마운트
from google.colab import drive

In [ ]:
#CSV 파일 DataFrame으로 불러오기
df_exam = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/file/exam.csv')
df_exam

In [16]:
#기본 요약 통계
df_exam.describe()

             id      class       math    english    science
count  20.00000  20.000000  20.000000  20.000000  20.000000
mean   10.50000   3.000000  57.450000  84.900000  59.450000
std     5.91608   1.450953  20.299015  12.875517  25.292968
min     1.00000   1.000000  20.000000  56.000000  12.000000
25%     5.75000   2.000000  45.750000  78.000000  45.000000
50%    10.50000   3.000000  54.000000  86.500000  62.500000
75%    15.25000   4.000000  75.750000  98.000000  78.000000
max    20.00000   5.000000  90.000000  98.000000  98.000000

In [17]:
#상위 5개 미리보기
df_exam.head()

   id  class  math  english  science
0   1      1    50       98       50
1   2      1    60       97       60
2   3      1    45       86       78
3   4      1    30       98       58
4   5      2    25       80       65

In [18]:
#하위 5개 미리보기
df_exam.tail()

    id  class  math  english  science
15  16      4    58       98       65
16  17      5    65       68       98
17  18      5    80       78       90
18  19      5    89       68       87
19  20      5    78       83       58

In [ ]:
#데이터프레임 인덱싱
#loc - 컬럼명 인덱싱
df_math = df_exam.loc[:, 'math']
print(df_math)

df_eng = df_exam.loc[:, 'english']
print(df_eng)

df_rs1 = df_exam.loc[1:4 , ['math','english']]
print(df_rs1)

df_rs2 = df_exam.loc[10: , ['math','english','science']]
print(df_rs2)

In [ ]:
#iloc - 인덱스 인덱싱
df_rs3 = df_exam.iloc[1:5,2:4]
print(df_rs3)

In [ ]:
#수학점수 내림차순
df_exam.sort_values(by='math', ascending=False)

In [32]:
#영어점수 60~70, 내림차순
df_exam[(df_exam.english >= 60) & (df_exam.english<70)].sort_values(by='english',ascending=False)

    id  class  math  english  science
16  17      5    65       68       98
18  19      5    89       68       87
10  11      3    65       65       65

In [38]:
#파생변수
df_exam['total'] = df_exam.math + df_exam.english + df_exam.science
df_exam['mean'] = df_exam.total /3
df_exam
df_exam['grade'] = if(df_exam.mean>= 60 )

SyntaxError: ignored